# Essential programs
brew "asdf"
brew "bat"
brew "btop"
brew "curl"
brew "duf"
brew "dust"
brew "entr"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gping"
brew "htop"
brew "ledger"
brew "libqalculate"
brew "lsd"
brew "mas"
brew "mosh"
brew "neovim"
brew "nmap"
brew "ossp-uuid"
brew "readline"
brew "rename"
brew "ripgrep"
brew "ssh-copy-id"
brew "stow"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zoxide"

# Games and fun stuff
brew "archey4"
brew "cheat"
brew "cmatrix"
brew "cowsay"
brew "figlet"
brew "fortune"
brew "nethack"
brew "sl"

# Native apps
cask "1password"
cask "alfred"
cask "appcleaner"
cask "audacity"
cask "beeper"
cask "calibre"
cask "daisydisk"
cask "dash"
cask "discord"
cask "docker"
cask "firefox"
cask "font-iosevka-nerd-font"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "logitech-options"
cask "lunar"
cask "qlmarkdown"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "vlc"
cask "whisky"

# Mac App Store apps
mas "1password-safari", id: 1569813296
mas "amphetamine", id: 937984704
mas "hush", id: 1544743900
mas "kagi", id: 1622835804
mas "kagi-for-safari", id: 1622835804
mas "privacy-redirect", id: 1578144015
mas "refined-github", id: 1519867270
mas "vimari", id: 1480933944
mas "wipr", id: 1320666476
mas "wireguard", id: 1451685025
